analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32665/Include/sdhc_regs.h
/**
 * @file    sdhc_regs.h
 * @brief   Registers, Bit Masks and Bit Positions for the SDHC Peripheral Module.
 * @note    This file is @generated.
 * @ingroup sdhc_registers
 */

/******************************************************************************
/******************************************************************************
 *
 * Copyright 2023 Analog Devices, Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************
 *
 * Copyright (C) 2022-2023 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 ******************************************************************************/

#ifndef LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32665_INCLUDE_SDHC_REGS_H_
#define LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32665_INCLUDE_SDHC_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined (__ICCARM__)
  #pragma system_include
#endif

#if defined (__CC_ARM)
  #pragma anon_unions
#endif
/// @cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/// @endcond

/* **** Definitions **** */

/**
 * @ingroup     sdhc
 * @defgroup    sdhc_registers SDHC_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the SDHC Peripheral Module.
 * @details     SDHC/SDIO Controller
 */

/**
 * @ingroup sdhc_registers
 * Structure type to access the SDHC Registers.
 */
typedef struct {
    __IO uint32_t sdma;                 /**< <tt>\b 0x00:</tt> SDHC SDMA Register */
    __IO uint16_t blk_size;             /**< <tt>\b 0x04:</tt> SDHC BLK_SIZE Register */
    __IO uint16_t blk_cnt;              /**< <tt>\b 0x06:</tt> SDHC BLK_CNT Register */
    __IO uint32_t arg_1;                /**< <tt>\b 0x08:</tt> SDHC ARG_1 Register */
    __IO uint16_t trans;                /**< <tt>\b 0x0C:</tt> SDHC TRANS Register */
    __IO uint16_t cmd;                  /**< <tt>\b 0x0E:</tt> SDHC CMD Register */
    __IO uint32_t resp[4];              /**< <tt>\b 0x010:</tt> SDHC RESP Register */
    __IO uint32_t buffer;               /**< <tt>\b 0x20:</tt> SDHC BUFFER Register */
    __I  uint32_t present;              /**< <tt>\b 0x024:</tt> SDHC PRESENT Register */
    __IO uint8_t  host_cn_1;            /**< <tt>\b 0x028:</tt> SDHC HOST_CN_1 Register */
    __IO uint8_t  pwr;                  /**< <tt>\b 0x029:</tt> SDHC PWR Register */
    __IO uint8_t  blk_gap;              /**< <tt>\b 0x02A:</tt> SDHC BLK_GAP Register */
    __IO uint8_t  wakeup;               /**< <tt>\b 0x02B:</tt> SDHC WAKEUP Register */
    __IO uint16_t clk_cn;               /**< <tt>\b 0x02C:</tt> SDHC CLK_CN Register */
    __IO uint8_t  to;                   /**< <tt>\b 0x02E:</tt> SDHC TO Register */
    __IO uint8_t  sw_reset;             /**< <tt>\b 0x02F:</tt> SDHC SW_RESET Register */
    __IO uint16_t int_stat;             /**< <tt>\b 0x030:</tt> SDHC INT_STAT Register */
    __IO uint16_t er_int_stat;          /**< <tt>\b 0x032:</tt> SDHC ER_INT_STAT Register */
    __IO uint16_t int_en;               /**< <tt>\b 0x034:</tt> SDHC INT_EN Register */
    __IO uint16_t er_int_en;            /**< <tt>\b 0x36:</tt> SDHC ER_INT_EN Register */
    __IO uint16_t int_signal;           /**< <tt>\b 0x038:</tt> SDHC INT_SIGNAL Register */
    __IO uint16_t er_int_signal;        /**< <tt>\b 0x03A:</tt> SDHC ER_INT_SIGNAL Register */
    __IO uint16_t auto_cmd_er;          /**< <tt>\b 0x03C:</tt> SDHC AUTO_CMD_ER Register */
    __IO uint16_t host_cn_2;            /**< <tt>\b 0x03E:</tt> SDHC HOST_CN_2 Register */
    __I  uint32_t cfg_0;                /**< <tt>\b 0x040:</tt> SDHC CFG_0 Register */
    __I  uint32_t cfg_1;                /**< <tt>\b 0x044:</tt> SDHC CFG_1 Register */
    __I  uint32_t max_curr_cfg;         /**< <tt>\b 0x048:</tt> SDHC MAX_CURR_CFG Register */
    __R  uint32_t rsv_0x4c;
    __O  uint16_t force_cmd;            /**< <tt>\b 0x050:</tt> SDHC FORCE_CMD Register */
    __IO uint16_t force_event_int_stat; /**< <tt>\b 0x052:</tt> SDHC FORCE_EVENT_INT_STAT Register */
    __IO uint8_t  adma_er;              /**< <tt>\b 0x054:</tt> SDHC ADMA_ER Register */
    __R  uint8_t  rsv_0x55_0x57[3];
    __IO uint32_t adma_addr_0;          /**< <tt>\b 0x058:</tt> SDHC ADMA_ADDR_0 Register */
    __IO uint32_t adma_addr_1;          /**< <tt>\b 0x05C:</tt> SDHC ADMA_ADDR_1 Register */
    __I  uint16_t preset_0;             /**< <tt>\b 0x060:</tt> SDHC PRESET_0 Register */
    __I  uint16_t preset_1;             /**< <tt>\b 0x062:</tt> SDHC PRESET_1 Register */
    __I  uint16_t preset_2;             /**< <tt>\b 0x064:</tt> SDHC PRESET_2 Register */
    __I  uint16_t preset_3;             /**< <tt>\b 0x066:</tt> SDHC PRESET_3 Register */
    __I  uint16_t preset_4;             /**< <tt>\b 0x068:</tt> SDHC PRESET_4 Register */
    __I  uint16_t preset_5;             /**< <tt>\b 0x06A:</tt> SDHC PRESET_5 Register */
    __I  uint16_t preset_6;             /**< <tt>\b 0x06C:</tt> SDHC PRESET_6 Register */
    __I  uint16_t preset_7;             /**< <tt>\b 0x06E:</tt> SDHC PRESET_7 Register */
    __R  uint32_t rsv_0x70_0xfb[35];
    __I  uint16_t slot_int;             /**< <tt>\b 0x0FC:</tt> SDHC SLOT_INT Register */
    __IO uint16_t host_cn_ver;          /**< <tt>\b 0x0FE:</tt> SDHC HOST_CN_VER Register */
} mxc_sdhc_regs_t;

/* Register offsets for module SDHC */
/**
 * @ingroup    sdhc_registers
 * @defgroup   SDHC_Register_Offsets Register Offsets
 * @brief      SDHC Peripheral Register Offsets from the SDHC Base Peripheral Address.
 * @{
 */
#define MXC_R_SDHC_SDMA                    ((uint32_t)0x00000000UL) /**< Offset from SDHC Base Address: <tt> 0x0000</tt> */
#define MXC_R_SDHC_BLK_SIZE                ((uint32_t)0x00000004UL) /**< Offset from SDHC Base Address: <tt> 0x0004</tt> */
#define MXC_R_SDHC_BLK_CNT                 ((uint32_t)0x00000006UL) /**< Offset from SDHC Base Address: <tt> 0x0006</tt> */
#define MXC_R_SDHC_ARG_1                   ((uint32_t)0x00000008UL) /**< Offset from SDHC Base Address: <tt> 0x0008</tt> */
#define MXC_R_SDHC_TRANS                   ((uint32_t)0x0000000CUL) /**< Offset from SDHC Base Address: <tt> 0x000C</tt> */
#define MXC_R_SDHC_CMD                     ((uint32_t)0x0000000EUL) /**< Offset from SDHC Base Address: <tt> 0x000E</tt> */
#define MXC_R_SDHC_RESP                    ((uint32_t)0x00000010UL) /**< Offset from SDHC Base Address: <tt> 0x0010</tt> */
#define MXC_R_SDHC_BUFFER                  ((uint32_t)0x00000020UL) /**< Offset from SDHC Base Address: <tt> 0x0020</tt> */
#define MXC_R_SDHC_PRESENT                 ((uint32_t)0x00000024UL) /**< Offset from SDHC Base Address: <tt> 0x0024</tt> */
#define MXC_R_SDHC_HOST_CN_1               ((uint32_t)0x00000028UL) /**< Offset from SDHC Base Address: <tt> 0x0028</tt> */
#define MXC_R_SDHC_PWR                     ((uint32_t)0x00000029UL) /**< Offset from SDHC Base Address: <tt> 0x0029</tt> */
#define MXC_R_SDHC_BLK_GAP                 ((uint32_t)0x0000002AUL) /**< Offset from SDHC Base Address: <tt> 0x002A</tt> */
#define MXC_R_SDHC_WAKEUP                  ((uint32_t)0x0000002BUL) /**< Offset from SDHC Base Address: <tt> 0x002B</tt> */
#define MXC_R_SDHC_CLK_CN                  ((uint32_t)0x0000002CUL) /**< Offset from SDHC Base Address: <tt> 0x002C</tt> */
#define MXC_R_SDHC_TO                      ((uint32_t)0x0000002EUL) /**< Offset from SDHC Base Address: <tt> 0x002E</tt> */
#define MXC_R_SDHC_SW_RESET                ((uint32_t)0x0000002FUL) /**< Offset from SDHC Base Address: <tt> 0x002F</tt> */
#define MXC_R_SDHC_INT_STAT                ((uint32_t)0x00000030UL) /**< Offset from SDHC Base Address: <tt> 0x0030</tt> */
#define MXC_R_SDHC_ER_INT_STAT             ((uint32_t)0x00000032UL) /**< Offset from SDHC Base Address: <tt> 0x0032</tt> */
#define MXC_R_SDHC_INT_EN                  ((uint32_t)0x00000034UL) /**< Offset from SDHC Base Address: <tt> 0x0034</tt> */
#define MXC_R_SDHC_ER_INT_EN               ((uint32_t)0x00000036UL) /**< Offset from SDHC Base Address: <tt> 0x0036</tt> */
#define MXC_R_SDHC_INT_SIGNAL              ((uint32_t)0x00000038UL) /**< Offset from SDHC Base Address: <tt> 0x0038</tt> */
#define MXC_R_SDHC_ER_INT_SIGNAL           ((uint32_t)0x0000003AUL) /**< Offset from SDHC Base Address: <tt> 0x003A</tt> */
#define MXC_R_SDHC_AUTO_CMD_ER             ((uint32_t)0x0000003CUL) /**< Offset from SDHC Base Address: <tt> 0x003C</tt> */
#define MXC_R_SDHC_HOST_CN_2               ((uint32_t)0x0000003EUL) /**< Offset from SDHC Base Address: <tt> 0x003E</tt> */
#define MXC_R_SDHC_CFG_0                   ((uint32_t)0x00000040UL) /**< Offset from SDHC Base Address: <tt> 0x0040</tt> */
#define MXC_R_SDHC_CFG_1                   ((uint32_t)0x00000044UL) /**< Offset from SDHC Base Address: <tt> 0x0044</tt> */
#define MXC_R_SDHC_MAX_CURR_CFG            ((uint32_t)0x00000048UL) /**< Offset from SDHC Base Address: <tt> 0x0048</tt> */
#define MXC_R_SDHC_FORCE_CMD               ((uint32_t)0x00000050UL) /**< Offset from SDHC Base Address: <tt> 0x0050</tt> */
#define MXC_R_SDHC_FORCE_EVENT_INT_STAT    ((uint32_t)0x00000052UL) /**< Offset from SDHC Base Address: <tt> 0x0052</tt> */
#define MXC_R_SDHC_ADMA_ER                 ((uint32_t)0x00000054UL) /**< Offset from SDHC Base Address: <tt> 0x0054</tt> */
#define MXC_R_SDHC_ADMA_ADDR_0             ((uint32_t)0x00000058UL) /**< Offset from SDHC Base Address: <tt> 0x0058</tt> */
#define MXC_R_SDHC_ADMA_ADDR_1             ((uint32_t)0x0000005CUL) /**< Offset from SDHC Base Address: <tt> 0x005C</tt> */
#define MXC_R_SDHC_PRESET_0                ((uint32_t)0x00000060UL) /**< Offset from SDHC Base Address: <tt> 0x0060</tt> */
#define MXC_R_SDHC_PRESET_1                ((uint32_t)0x00000062UL) /**< Offset from SDHC Base Address: <tt> 0x0062</tt> */
#define MXC_R_SDHC_PRESET_2                ((uint32_t)0x00000064UL) /**< Offset from SDHC Base Address: <tt> 0x0064</tt> */
#define MXC_R_SDHC_PRESET_3                ((uint32_t)0x00000066UL) /**< Offset from SDHC Base Address: <tt> 0x0066</tt> */
#define MXC_R_SDHC_PRESET_4                ((uint32_t)0x00000068UL) /**< Offset from SDHC Base Address: <tt> 0x0068</tt> */
#define MXC_R_SDHC_PRESET_5                ((uint32_t)0x0000006AUL) /**< Offset from SDHC Base Address: <tt> 0x006A</tt> */
#define MXC_R_SDHC_PRESET_6                ((uint32_t)0x0000006CUL) /**< Offset from SDHC Base Address: <tt> 0x006C</tt> */
#define MXC_R_SDHC_PRESET_7                ((uint32_t)0x0000006EUL) /**< Offset from SDHC Base Address: <tt> 0x006E</tt> */
#define MXC_R_SDHC_SLOT_INT                ((uint32_t)0x000000FCUL) /**< Offset from SDHC Base Address: <tt> 0x00FC</tt> */
#define MXC_R_SDHC_HOST_CN_VER             ((uint32_t)0x000000FEUL) /**< Offset from SDHC Base Address: <tt> 0x00FE</tt> */
/**@} end of group sdhc_registers */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_SDMA SDHC_SDMA
 * @brief    SDMA System Address / Argument 2.
 * @{
 */
#define MXC_F_SDHC_SDMA_ADDR_POS                       0 /**< SDMA_ADDR Position */
#define MXC_F_SDHC_SDMA_ADDR                           ((uint32_t)(0xFFFFFFFFUL << MXC_F_SDHC_SDMA_ADDR_POS)) /**< SDMA_ADDR Mask */

/**@} end of group SDHC_SDMA_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_BLK_SIZE SDHC_BLK_SIZE
 * @brief    Block Size.
 * @{
 */
#define MXC_F_SDHC_BLK_SIZE_TRANS_POS                  0 /**< BLK_SIZE_TRANS Position */
#define MXC_F_SDHC_BLK_SIZE_TRANS                      ((uint16_t)(0xFFFUL << MXC_F_SDHC_BLK_SIZE_TRANS_POS)) /**< BLK_SIZE_TRANS Mask */

#define MXC_F_SDHC_BLK_SIZE_HOST_BUFF_POS              12 /**< BLK_SIZE_HOST_BUFF Position */
#define MXC_F_SDHC_BLK_SIZE_HOST_BUFF                  ((uint16_t)(0x7UL << MXC_F_SDHC_BLK_SIZE_HOST_BUFF_POS)) /**< BLK_SIZE_HOST_BUFF Mask */

/**@} end of group SDHC_BLK_SIZE_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_BLK_CNT SDHC_BLK_CNT
 * @brief    Block Count.
 * @{
 */
#define MXC_F_SDHC_BLK_CNT_COUNT_POS                   0 /**< BLK_CNT_COUNT Position */
#define MXC_F_SDHC_BLK_CNT_COUNT                       ((uint16_t)(0xFFFFUL << MXC_F_SDHC_BLK_CNT_COUNT_POS)) /**< BLK_CNT_COUNT Mask */

/**@} end of group SDHC_BLK_CNT_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_ARG_1 SDHC_ARG_1
 * @brief    Argument 1.
 * @{
 */
#define MXC_F_SDHC_ARG_1_CMD_POS                       0 /**< ARG_1_CMD Position */
#define MXC_F_SDHC_ARG_1_CMD                           ((uint32_t)(0xFFFFFFFFUL << MXC_F_SDHC_ARG_1_CMD_POS)) /**< ARG_1_CMD Mask */

/**@} end of group SDHC_ARG_1_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_TRANS SDHC_TRANS
 * @brief    Transfer Mode.
 * @{
 */
#define MXC_F_SDHC_TRANS_DMA_EN_POS                    0 /**< TRANS_DMA_EN Position */
#define MXC_F_SDHC_TRANS_DMA_EN                        ((uint16_t)(0x1UL << MXC_F_SDHC_TRANS_DMA_EN_POS)) /**< TRANS_DMA_EN Mask */

#define MXC_F_SDHC_TRANS_BLK_CNT_EN_POS                1 /**< TRANS_BLK_CNT_EN Position */
#define MXC_F_SDHC_TRANS_BLK_CNT_EN                    ((uint16_t)(0x1UL << MXC_F_SDHC_TRANS_BLK_CNT_EN_POS)) /**< TRANS_BLK_CNT_EN Mask */

#define MXC_F_SDHC_TRANS_AUTO_CMD_EN_POS               2 /**< TRANS_AUTO_CMD_EN Position */
#define MXC_F_SDHC_TRANS_AUTO_CMD_EN                   ((uint16_t)(0x3UL << MXC_F_SDHC_TRANS_AUTO_CMD_EN_POS)) /**< TRANS_AUTO_CMD_EN Mask */
#define MXC_V_SDHC_TRANS_AUTO_CMD_EN_DISABLE           ((uint16_t)0x0UL) /**< TRANS_AUTO_CMD_EN_DISABLE Value */
#define MXC_S_SDHC_TRANS_AUTO_CMD_EN_DISABLE           (MXC_V_SDHC_TRANS_AUTO_CMD_EN_DISABLE << MXC_F_SDHC_TRANS_AUTO_CMD_EN_POS) /**< TRANS_AUTO_CMD_EN_DISABLE Setting */
#define MXC_V_SDHC_TRANS_AUTO_CMD_EN_CMD12             ((uint16_t)0x1UL) /**< TRANS_AUTO_CMD_EN_CMD12 Value */
#define MXC_S_SDHC_TRANS_AUTO_CMD_EN_CMD12             (MXC_V_SDHC_TRANS_AUTO_CMD_EN_CMD12 << MXC_F_SDHC_TRANS_AUTO_CMD_EN_POS) /**< TRANS_AUTO_CMD_EN_CMD12 Setting */
#define MXC_V_SDHC_TRANS_AUTO_CMD_EN_CMD23             ((uint16_t)0x2UL) /**< TRANS_AUTO_CMD_EN_CMD23 Value */
#define MXC_S_SDHC_TRANS_AUTO_CMD_EN_CMD23             (MXC_V_SDHC_TRANS_AUTO_CMD_EN_CMD23 << MXC_F_SDHC_TRANS_AUTO_CMD_EN_POS) /**< TRANS_AUTO_CMD_EN_CMD23 Setting */

#define MXC_F_SDHC_TRANS_READ_WRITE_POS                4 /**< TRANS_READ_WRITE Position */
#define MXC_F_SDHC_TRANS_READ_WRITE                    ((uint16_t)(0x1UL << MXC_F_SDHC_TRANS_READ_WRITE_POS)) /**< TRANS_READ_WRITE Mask */

