analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32665/Include/sdhc_regs.h
#define MXC_F_SDHC_TRANS_MULTI_POS                     5 /**< TRANS_MULTI Position */
#define MXC_F_SDHC_TRANS_MULTI                         ((uint16_t)(0x1UL << MXC_F_SDHC_TRANS_MULTI_POS)) /**< TRANS_MULTI Mask */

/**@} end of group SDHC_TRANS_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_CMD SDHC_CMD
 * @brief    Command.
 * @{
 */
#define MXC_F_SDHC_CMD_RESP_TYPE_POS                   0 /**< CMD_RESP_TYPE Position */
#define MXC_F_SDHC_CMD_RESP_TYPE                       ((uint16_t)(0x3UL << MXC_F_SDHC_CMD_RESP_TYPE_POS)) /**< CMD_RESP_TYPE Mask */

#define MXC_F_SDHC_CMD_CRC_CHK_EN_POS                  3 /**< CMD_CRC_CHK_EN Position */
#define MXC_F_SDHC_CMD_CRC_CHK_EN                      ((uint16_t)(0x1UL << MXC_F_SDHC_CMD_CRC_CHK_EN_POS)) /**< CMD_CRC_CHK_EN Mask */

#define MXC_F_SDHC_CMD_IDX_CHK_EN_POS                  4 /**< CMD_IDX_CHK_EN Position */
#define MXC_F_SDHC_CMD_IDX_CHK_EN                      ((uint16_t)(0x1UL << MXC_F_SDHC_CMD_IDX_CHK_EN_POS)) /**< CMD_IDX_CHK_EN Mask */

#define MXC_F_SDHC_CMD_DATA_PRES_SEL_POS               5 /**< CMD_DATA_PRES_SEL Position */
#define MXC_F_SDHC_CMD_DATA_PRES_SEL                   ((uint16_t)(0x1UL << MXC_F_SDHC_CMD_DATA_PRES_SEL_POS)) /**< CMD_DATA_PRES_SEL Mask */

#define MXC_F_SDHC_CMD_TYPE_POS                        6 /**< CMD_TYPE Position */
#define MXC_F_SDHC_CMD_TYPE                            ((uint16_t)(0x3UL << MXC_F_SDHC_CMD_TYPE_POS)) /**< CMD_TYPE Mask */

#define MXC_F_SDHC_CMD_IDX_POS                         8 /**< CMD_IDX Position */
#define MXC_F_SDHC_CMD_IDX                             ((uint16_t)(0x3FUL << MXC_F_SDHC_CMD_IDX_POS)) /**< CMD_IDX Mask */

/**@} end of group SDHC_CMD_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_RESP SDHC_RESP
 * @brief    Response 0 Register 0-15.
 * @{
 */
#define MXC_F_SDHC_RESP_CMD_RESP_POS                   0 /**< RESP_CMD_RESP Position */
#define MXC_F_SDHC_RESP_CMD_RESP                       ((uint32_t)(0xFFFFFFFFUL << MXC_F_SDHC_RESP_CMD_RESP_POS)) /**< RESP_CMD_RESP Mask */

/**@} end of group SDHC_RESP_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_BUFFER SDHC_BUFFER
 * @brief    Buffer Data Port.
 * @{
 */
#define MXC_F_SDHC_BUFFER_DATA_POS                     0 /**< BUFFER_DATA Position */
#define MXC_F_SDHC_BUFFER_DATA                         ((uint32_t)(0xFFFFFFFFUL << MXC_F_SDHC_BUFFER_DATA_POS)) /**< BUFFER_DATA Mask */

/**@} end of group SDHC_BUFFER_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_PRESENT SDHC_PRESENT
 * @brief    Present State.
 * @{
 */
#define MXC_F_SDHC_PRESENT_CMD_POS                     0 /**< PRESENT_CMD Position */
#define MXC_F_SDHC_PRESENT_CMD                         ((uint32_t)(0x1UL << MXC_F_SDHC_PRESENT_CMD_POS)) /**< PRESENT_CMD Mask */

#define MXC_F_SDHC_PRESENT_DAT_POS                     1 /**< PRESENT_DAT Position */
#define MXC_F_SDHC_PRESENT_DAT                         ((uint32_t)(0x1UL << MXC_F_SDHC_PRESENT_DAT_POS)) /**< PRESENT_DAT Mask */

#define MXC_F_SDHC_PRESENT_DAT_LINE_ACTIVE_POS         2 /**< PRESENT_DAT_LINE_ACTIVE Position */
#define MXC_F_SDHC_PRESENT_DAT_LINE_ACTIVE             ((uint32_t)(0x1UL << MXC_F_SDHC_PRESENT_DAT_LINE_ACTIVE_POS)) /**< PRESENT_DAT_LINE_ACTIVE Mask */

#define MXC_F_SDHC_PRESENT_RETUNING_POS                3 /**< PRESENT_RETUNING Position */
#define MXC_F_SDHC_PRESENT_RETUNING                    ((uint32_t)(0x1UL << MXC_F_SDHC_PRESENT_RETUNING_POS)) /**< PRESENT_RETUNING Mask */

#define MXC_F_SDHC_PRESENT_WRITE_TRANSFER_POS          8 /**< PRESENT_WRITE_TRANSFER Position */
#define MXC_F_SDHC_PRESENT_WRITE_TRANSFER              ((uint32_t)(0x1UL << MXC_F_SDHC_PRESENT_WRITE_TRANSFER_POS)) /**< PRESENT_WRITE_TRANSFER Mask */

#define MXC_F_SDHC_PRESENT_READ_TRANSFER_POS           9 /**< PRESENT_READ_TRANSFER Position */
#define MXC_F_SDHC_PRESENT_READ_TRANSFER               ((uint32_t)(0x1UL << MXC_F_SDHC_PRESENT_READ_TRANSFER_POS)) /**< PRESENT_READ_TRANSFER Mask */

#define MXC_F_SDHC_PRESENT_BUFFER_WRITE_POS            10 /**< PRESENT_BUFFER_WRITE Position */
#define MXC_F_SDHC_PRESENT_BUFFER_WRITE                ((uint32_t)(0x1UL << MXC_F_SDHC_PRESENT_BUFFER_WRITE_POS)) /**< PRESENT_BUFFER_WRITE Mask */

#define MXC_F_SDHC_PRESENT_BUFFER_READ_POS             11 /**< PRESENT_BUFFER_READ Position */
#define MXC_F_SDHC_PRESENT_BUFFER_READ                 ((uint32_t)(0x1UL << MXC_F_SDHC_PRESENT_BUFFER_READ_POS)) /**< PRESENT_BUFFER_READ Mask */

#define MXC_F_SDHC_PRESENT_CARD_INSERTED_POS           16 /**< PRESENT_CARD_INSERTED Position */
#define MXC_F_SDHC_PRESENT_CARD_INSERTED               ((uint32_t)(0x1UL << MXC_F_SDHC_PRESENT_CARD_INSERTED_POS)) /**< PRESENT_CARD_INSERTED Mask */

#define MXC_F_SDHC_PRESENT_CARD_STATE_POS              17 /**< PRESENT_CARD_STATE Position */
#define MXC_F_SDHC_PRESENT_CARD_STATE                  ((uint32_t)(0x1UL << MXC_F_SDHC_PRESENT_CARD_STATE_POS)) /**< PRESENT_CARD_STATE Mask */

#define MXC_F_SDHC_PRESENT_CARD_DETECT_POS             18 /**< PRESENT_CARD_DETECT Position */
#define MXC_F_SDHC_PRESENT_CARD_DETECT                 ((uint32_t)(0x1UL << MXC_F_SDHC_PRESENT_CARD_DETECT_POS)) /**< PRESENT_CARD_DETECT Mask */

#define MXC_F_SDHC_PRESENT_WP_POS                      19 /**< PRESENT_WP Position */
#define MXC_F_SDHC_PRESENT_WP                          ((uint32_t)(0x1UL << MXC_F_SDHC_PRESENT_WP_POS)) /**< PRESENT_WP Mask */

#define MXC_F_SDHC_PRESENT_DAT_SIGNAL_LEVEL_POS        20 /**< PRESENT_DAT_SIGNAL_LEVEL Position */
#define MXC_F_SDHC_PRESENT_DAT_SIGNAL_LEVEL            ((uint32_t)(0xFUL << MXC_F_SDHC_PRESENT_DAT_SIGNAL_LEVEL_POS)) /**< PRESENT_DAT_SIGNAL_LEVEL Mask */

#define MXC_F_SDHC_PRESENT_CMD_SIGNAL_LEVEL_POS        24 /**< PRESENT_CMD_SIGNAL_LEVEL Position */
#define MXC_F_SDHC_PRESENT_CMD_SIGNAL_LEVEL            ((uint32_t)(0x1UL << MXC_F_SDHC_PRESENT_CMD_SIGNAL_LEVEL_POS)) /**< PRESENT_CMD_SIGNAL_LEVEL Mask */

/**@} end of group SDHC_PRESENT_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_HOST_CN_1 SDHC_HOST_CN_1
 * @brief    Host Control 1.
 * @{
 */
#define MXC_F_SDHC_HOST_CN_1_LED_CN_POS                0 /**< HOST_CN_1_LED_CN Position */
#define MXC_F_SDHC_HOST_CN_1_LED_CN                    ((uint8_t)(0x1UL << MXC_F_SDHC_HOST_CN_1_LED_CN_POS)) /**< HOST_CN_1_LED_CN Mask */

